In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [2]:
df = pd.read_csv("homeprices.csv")
df

   area   bedrooms  age   price
0   2600       3.0   20  550000
1   3000       4.0   15  565000
2   3200       NaN   18  610000
3   3600       3.0   30  595000
4   4000       5.0    8  760000

In [3]:
# filling missing data in bedroom col

import math
median_bedrooms = math.floor(df.bedrooms.median())  # to get only int and not float or decimal no.
median_bedrooms

3

In [4]:
df.bedrooms = df.bedrooms.fillna(median_bedrooms)
df  # updated df

   area   bedrooms  age   price
0   2600       3.0   20  550000
1   3000       4.0   15  565000
2   3200       3.0   18  610000
3   3600       3.0   30  595000
4   4000       5.0    8  760000

In [5]:
df.columns

Index(['area ', 'bedrooms', 'age', 'price'], dtype='object')

In [6]:
reg = linear_model.LinearRegression()
reg.fit(df[['area ', 'bedrooms', 'age']],df.price)   # reg.fit(X,y)

# copy paste the names of column from df.columns o/p as if there is 
# some space or syntax erro in col name then there will be error in further code

LinearRegression()

In [7]:
reg.coef_

array([   137.25, -26025.  ,  -6825.  ])

In [8]:
reg.intercept_

383724.9999999998

In [13]:
reg.predict([[3000,3,40]])

array([444400.])

In [14]:
#  calc 
137.25*3000 + -26025*3 + -6825*40 + 383724.9999999998

444399.9999999998

In [17]:
reg.predict([[2500,4,5]])

array([588625.])

## With Train and Split Data

In [18]:
# from sklearn.metrics import r2_score
# score = r2_score(y_test,output_predicted)
# score

In [35]:
df2 = pd.read_csv("homeprices_2.csv")
df2
# df2.columns

      town   area   price
0   calgary  2600  550000
1   calgary  3000  565000
2   calgary  3200  610000
3   calgary  3600  680000
4   calgary  4000  725000
5   ontario  2600  585000
6   ontario  2800  615000
7   ontario  3300  650000
8   ontario  3600  710000
9   toronto  2600  575000
10  toronto  2900  600000
11  toronto  3100  620000
12  toronto  3600  695000

In [30]:
X = df2.iloc[:,1:]
X

    area   price
0   2600  550000
1   3000  565000
2   3200  610000
3   3600  680000
4   4000  725000
5   2600  585000
6   2800  615000
7   3300  650000
8   3600  710000
9   2600  575000
10  2900  600000
11  3100  620000
12  3600  695000

In [32]:
y = df2.iloc[:,0]
y

0     calgary
1     calgary
2     calgary
3     calgary
4     calgary
5     ontario
6     ontario
7     ontario
8     ontario
9     toronto
10    toronto
11    toronto
12    toronto
Name: town , dtype: object

In [42]:
towns= pd.get_dummies(X['town'].drop_first=True)

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (Temp/ipykernel_26148/2049181347.py, line 1)